app/views/seasons/_form.html.erb

<%= form_for([@series=Series.find(params[:series_id]), @series.seasons.build]) do |f| %>
---
SELECT `series`.* FROM `series` WHERE `series`.`id` = ? LIMIT 1  [["id", "1"]]