app/views/seasons/index.html.erb

<% @series.seasons.each do |season| %>
---
SELECT `seasons`.* FROM `seasons` WHERE `seasons`.`series_id` = 1


<!--%= link_to 'New Season', new_series_season_path(@series=Series.find(params[:id])) %-->
---
SELECT `series`.* FROM `series` WHERE `series`.`id` = ? LIMIT 1  [["id", "1"]]