app/controllers/episodes_controller.rb

SELECT `episodes`.* FROM `episodes` WHERE `episodes`.`id` = ? LIMIT 1  [["id", "1"]]
---
  def show
    @episode = Episode.find(params[:id])

SELECT `series`.* FROM `series` WHERE `series`.`id` = ? LIMIT 1  [["id", "1"]]
SELECT `seasons`.* FROM `seasons` WHERE `seasons`.`series_id` = 1 AND `seasons`.`id` = ? LIMIT 1  [["id", "1"]]
---
  def new
    @series=Series.find(params[:series_id])
    @season = @series.seasons.find(params[:season_id])

INSERT INTO `episodes` (`created_at`, `inair`, `season_id`, `title`, `updated_at`) VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 24 Nov 2011 10:01:42 UTC +00:00], ["inair", Thu, 24 Nov 2011], ["season_id", 1], ["title", "Cenas"], ["updated_at", Thu, 24 Nov 2011 10:01:42 UTC +00:00]]
---
  def create
    @episode = Episode.new(params[:episode])
    @episode.season_id = params[:season_id]

    respond_to do |format|
      if @episode.save