app/controllers/messages_controller.rb

  def index
    @messages = Message.find_all_by_to_id_and_bdeleted_to(session[:user_id],false)
---
SELECT `messages`.* FROM `messages` WHERE `messages`.`to_id` = 2 AND `messages`.`bdeleted_to` = 0

  def index_sent
    @messages = Message.find_all_by_from_id_and_bdeleted_from(session[:user_id],false)
---
SELECT `messages`.* FROM `messages` WHERE `messages`.`from_id` = 2 AND `messages`.`bdeleted_from` = 0

  def show
    @message = Message.find(params[:id])
    if @message.to.id == session[:user_id]
     @message.update_attributes(:bread_to => true)
---
SELECT `messages`.* FROM `messages` WHERE `messages`.`id` = ? LIMIT 1  [["id", "1"]]
UPDATE `messages` SET `bread_to` = 1, `updated_at` = '2011-12-04 18:00:04' WHERE `messages`.`id` = 1

  def show_sent
    @message = Message.find(params[:id])
---
SELECT `messages`.* FROM `messages` WHERE `messages`.`id` = ? LIMIT 1  [["id", "17"]]

  def create
    @buf = params[:message]
    @buf[:to] = UsersController::User.find_by_name(@buf[:to])
    @buf[:from] = UsersController::User.find_by_name(session[:user_name])
    @message = Message.new(params[:message])

    respond_to do |format|
      if @message.save
---
SELECT `users`.* FROM `users` WHERE `users`.`name` IS NULL LIMIT 1
INSERT INTO `messages` (`b_deleted_to`, `bdeleted_from`, `bread_from`, `bread_to`, `content`, `created_at`, `date`, `from_id`, `sender_id`, `subject`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def delete_from
     @message = Message.find(params[:id])
     if(@message[:bdeleted_to] == true)
       @message.destroy

        respond_to do |format|
            format.html { redirect_to sent_messages_url }
            format.json { head :ok }
        end
     else
       respond_to do |format|
        if @message.update_attributes(:bdeleted_from => true)
---
SELECT `messages`.* FROM `messages` WHERE `messages`.`id` = ? LIMIT 1  [["id", "8"]]
DELETE FROM `messages` WHERE `messages`.`id` = ?  [["id", 16]]
UPDATE `messages` SET `bdeleted_from` = 1, `updated_at` = '2011-12-04 21:08:04' WHERE `messages`.`id` = 8

  def delete_to
     @message = Message.find(params[:id])
     if(@message[:bdeleted_from] == true)
       @message.destroy

        respond_to do |format|
            format.html { redirect_to messages_url }
            format.json { head :ok }
        end
     else
       respond_to do |format|
        if @message.update_attributes(:bdeleted_to => true)
---
SELECT `messages`.* FROM `messages` WHERE `messages`.`id` = ? LIMIT 1  [["id", "16"]]
UPDATE `messages` SET `bdeleted_to` = 1, `updated_at` = '2011-12-04 21:46:32' WHERE `messages`.`id` = 16

  def destroy
    @message = Message.find(params[:id])
    @message.destroy
---
SELECT `messages`.* FROM `messages` WHERE `messages`.`id` = ? LIMIT 1  [["id", "5"]]
DELETE FROM `messages` WHERE `messages`.`id` = ?  [["id", 5]]