app/controllers/search_controller.rb

  def create
    @search = Search.new
    @search.keywords = params[:keywords]
    #@search.save
    #session[:keywords] = params[:keywords]

    @series = @search.series.paginate({:page => params[:page], :per_page => 30})
---
SELECT `series`.* FROM `series` WHERE (series.name LIKE '%teste%')