app/controllers/seasons_controller.rb

  def index
    @series=Series.find(params[:series_id])
---
SELECT `series`.* FROM `series` WHERE `series`.`id` = ? LIMIT 1  [["id", "1"]]

  def show
    @season = Season.find(params[:id])
---
SELECT `seasons`.* FROM `seasons` WHERE `seasons`.`id` = ? LIMIT 1  [["id", "1"]]

  def new
    @series=Series.find(params[:series_id])
---
SELECT `series`.* FROM `series` WHERE `series`.`id` = ? LIMIT 1  [["id", "1"]]

  def create
    @season = Season.new(params[:season])
    @serie = Series.find(params[:series_id])
    @season.series_id = params[:series_id]
    respond_to do |format|
      if @season.save
---
SELECT `series`.* FROM `series` WHERE `series`.`id` = ? LIMIT 1  [["id", "1"]]
INSERT INTO `seasons` (`created_at`, `number`, `series_id`, `updated_at`, `year`) VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 24 Nov 2011 10:01:29 UTC +00:00], ["number", 1], ["series_id", 1], ["updated_at", Thu, 24 Nov 2011 10:01:29 UTC +00:00], ["year", Thu, 24 Nov 2011 10:01:00 UTC +00:00]]