app/controllers/series_controller.rb

  def index
    @series = Series.all
---
SELECT `series`.* FROM `series`

  def show
    @series = Series.find(params[:id])
---
SELECT `series`.* FROM `series` WHERE `series`.`id` = ? LIMIT 1  [["id", "1"]]

  def create
    @series = Series.new(params[:series])

    respond_to do |format|
      if @series.save
---
INSERT INTO `series` (`country`, `created_at`, `name`, `updated_at`) VALUES (?, ?, ?, ?)  [["country", "US"], ["created_at", Thu, 24 Nov 2011 10:01:22 UTC +00:00], ["name", "prison break"], ["updated_at", Thu, 24 Nov 2011 10:01:22 UTC +00:00]]