app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`birthday`, `city`, `created_at`, `email`, `hashed_password`, `name`, `nationality`, `reset_password_code`, `reset_password_code_until`, `salt`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
UPDATE `users` SET `email` = 'kagereikon@hotmail.com', `salt` = '360211080.9775545141286985', `hashed_password` = 'c89bcfdcad08acd43151de03cf929c2e1affc5b0dc809caa818d4ed081d6b508', `updated_at` = '2011-11-24 04:50:12' WHERE `users`.`id` = 4

  def forgot_password
    user = User.find_by_email(params[:email])
    respond_to do |format|
      if (user)
        user.reset_password_code_until = 1.day.from_now
        user.reset_password_code = Digest::SHA1.hexdigest( "#{user.email}#{Time.now.to_s.split(//).sort_by {rand}.join}" )
        user.save!
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'ei06094@fe.up.pt' LIMIT 1
UPDATE `users` SET `updated_at` = '2011-11-24 10:04:46', `reset_password_code_until` = '2011-11-25 10:04:46', `reset_password_code` = 'e8ba5f8f385080c64e5efcc17f71e9adf7cae687' WHERE `users`.`id` = 1

  def reset_password
    user = User.find_by_reset_password_code(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`reset_password_code` = '3331a032210ca520d45ad654f6e88e85a5a4c29e' LIMIT 1

  def edit_password
    @user = User.find_by_reset_password_code(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`reset_password_code` = '3331a032210ca520d45ad654f6e88e85a5a4c29e' LIMIT 1