app/views/series/show.html.erb

SELECT `seasons`.* FROM `seasons` WHERE `seasons`.`series_id` = 1
---
<h2>Seasons</h2>
<% @series.seasons.each do |season| %>